# 어떤 환경에서 시작할지 결정함
FROM node:25.5.0

# 컨테이너 내부의 작업 폴더 지정
# 도커 컨테이너 안에서 앞으로의 모든 명령어가 실행될 폴더를 /app으로 지정
# (윈도우의 새 폴더 생성 + 해당 폴더로 이동 같은 거임)
WORKDIR /app

# 의존성 파일 먼저 복사
# 파일 목록만 먼저 복사하는 이유는 코드가 바뀌어도 라이브러리가 그대로면
# 설치 과정(npm i)을 재사용해서 빌드 속도를 높이기 위함
COPY package*.json ./

# 의존성 설치
# package.json 기반으로 node_modules 폴더에 라이브러리들을 설치함
RUN npm install

# 소스 코드 전체 복사
# 첫 번째 점(.)은 내 컴퓨터(호스트)의 현재 프로젝트를 의미함 -> Dockerfile이 있는 폴더 내부를 지칭함
# 두 번째 점은 도커 컨테이너 내부의 현재 작업 디렉토리를 의미함 -> WORKDIR /app에 의해 도커 안의 /app 폴더 안으로 복사함
COPY . .

# 이 컨테이너가 8080번 포트를 사용한다고 명시함
# AWS 배포 시 이 포트를 통해 접속하게 됨
EXPOSE 8080

# 관리자 권한 내려놓기 (보안 설정임)
# 도커는 root(관리자) 권한이 default인데, 해킹 방지를 위해
# node 이미지에 미리 만들어져 있는 일반 사용자 'node' 계정으로 전환함
#
# root 사용자는 시스템 전체 제어 권한이 있음
# 해커가 친입하면 시스템 전체를 장악할 수 있기 때문에 (내부 파일 뒤지거나, 다른 서버 공격하는 좀비 PC로 이용, 최악에는 AWS 서버 장악 등)
# user 설정하면 친입해도 일개 일반 사용자라서 권한 없음으로 피해를 줄일 수 있음
USER node

# 서버 실행 명령어임
# 컨테이너가 실행될 때 이 명령어를 실행함
# 보통 터미널에서 서버 실행할 때 쓰는 명령어를 적으면 됨
CMD ["npm", "start"]
